#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<stdlib.h>
#include<Windows.h>


//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%c", a[256]);
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	//00000000000000000000000000000000
//	//00000000000000000000000000001001
//	//00000000000000000000000000000000
//	//10000000000000000000000000000001
//	//
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//00000000000000000000000000000000
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//	unsigned int j = 10;
//	//00000000000000000000000000000000
//	//00000000000000000000000000001010
//	//11111111111111111111111111101100
//	//11111111111111111111111111110110
//	//%d——打印十进制有符号数字
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010
//	printf("%d\n", i + j);
//	return 0;
//}
//int main()
//{
//	char a = 128;
//	//10000000
//	//11111111111111111111111110000000
//	char b = -128;
//	printf("%u\n", a);
//	printf("%u\n", b);
//	return 0;
//}
//int main()
//{
//	char a = 127;
//	//01111111
//	char b = 1;
//	//00000001
//	char c = a + b;
//	//10000000
//	//1111111111111111111111111111111110000000
//	//1111111111111111111111111111111101111111
//	//1000000000000000000000000000000010000000
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{
//	char a = -128;
//	//-128的原码：
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111反码
//	//11111111111111111111111110000000补码
//	//10000000
//	//11111111111111111111111110000000补码
//	//%u：打印无符号十进制数字：正数，或者负数，直接打印出补码对应的值
//	printf("%u\n", a);
//	return 0;
//}
//int main()
//{
//	char a = -1;
//	//-1
//	//10000000000000000000000000000001— -1原码
//	//11111111111111111111111111111110— -1反码
//	//11111111111111111111111111111111— -1补码
//	//这是-1的二进制表示形式
//	//要放到char中，char只有一个字节即8个bit，故要发生截断
//	//存放到字符型变量a的-1
//	//11111111
//	//要打印：整型提升
//	//有符号char
//	//11111111111111111111111111111111补码
//	//11111111111111111111111111111110反码
//	//10000000000000000000000000000001原码
//	//解读得-1
//	signed char b = -1;
//	//同理char
//	unsigned char c = -1;
//	//发生截断：
//	//11111111
//	//无符号数整型提升
//	//00000000000000000000000011111111
//	//为255
//	printf("%d,%d,%d", a, b, c);//-1,
//	return 0;
//}

//指针类型的意义：
//指针类型决定了指针解引用操作符能访问几个字节：char* p：*p能访问一个字节，int* p ：*p能访问四个字节
//指针类型决定了指针的步长：决定了指针+1，-1，加的是几个字节：char* p：p+1跳过以一个字节的地址，int* p：p+1，跳过四个字节
//int main()
//{
//	int a = 0x11223344;
//	/*int *p = &a;*///访问并改变了四个字节的内容
//	/*char* p = (char*)&a;*///访问并改变了一个字节的内容
//	/**p = 0;*/
//	return 0;
//}
//check_system()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//int check_system()
//{
//	int a = 1;
//	return *(char*)&a;//返回1：小端，返回0：大端。
//}
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序
//	//如果函数返回1：小端
//	//如果函数返回0：大端
//	int ret = check_system();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//int main()
//{
//	int a = 20;
//	//000000000000000000000000000010100
//	//0x00000014
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int a = 20;
//	//00000000000000000000000000010100——原码
//	//00000000000000000000000000010100——反码
//	//00000000000000000000000000010100——补码
//	//0x00000014
//	int b = -20;
//	//10000000000000000000000000001010原码
//	//11111111111111111111111111110101反码
//	//1111 1111 1111111111111111 1111 0110补码
//	//0xffffff6
//	return 0;
//}
////void 无参
//void test(void)
//{
//	printf("hehe\n");
//}
//int main()
//{
//	test(100);
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//	short int b = 10;
//	signed short int b = 10;
//	return 0;
//}
//strlen()函数的实现：
//#include<stdio.h>
//#include<assert.h>
//int my_strlen(const char* str)
//{
//	assert(str != NULL);//保证指针的有效性
//	int count = 0;
//	while (*str++ != '\0')
//	{
//		count++;
//	}
//	return count;
//}
//int main()
//{
//	char arr[] = "abcdefg";
//	int len = my_strlen(arr);
//	printf("%d\n", len);
//	return 0;
//}
//#include<assert.h>
//#include<stdio.h>
//char* my_strcpy(char* dest,const char* src)
//{
//	char* ret = dest;
//	assert(dest != NULL);
//	assert(src != NULL);
//	//把src指向的字符串拷贝到dest指向的空间，包含'\0'字符；
//	while (*dest++ = *src++)
//	{
//		;
//	}
//	return ret;
//}
//int main()
//{
//	//strcpy
//	//字符串拷贝：
//	char arr1[] = "###";
//	char arr2[] = "bit";
//	printf("%s\n", my_strcpy(arr1, arr2));
//	return 0;
//}