#include<stdio.h>

//隐式类型转换：
//C的整形算术运算总是至少以默认整型类型的精度来进行的。
//为了获得这个精度，表达式中字符型和短整型操作数在使用之前被转化为普通整型：
//这种转换也被称为：整型提升。
//int main()
//{
//	//00000000000000000000000000111100
//	char a = 60;
//	//00111100
//	char b = 123;
//	//01111011   3    8	16	32	64
//	char c = a + b;
//	//10110111
//	//11111111111111111111111110110111
//	//11111111111111111111111110110110
//	//10000000000000000000000001001001    1    8    64    
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{
//	//3是一个整型数字，默认表示形式：
//	//  3 :00000000000000000000000000000011
//	//char只有八个比特位：对3截断：
//	//  a :00000011
//	//同理：b:127
//	//01111111
//	char a = 3;
//	char b = 127;
//	//在使用a时，a的精度只有一个字节，缺省整型类型的精度为4个字节
//	//使用字符型和短整型使系统默认整型提升为普通整形：
//	
//	//在使用b时，b只有一个字节，缺省整型类型的精度为4个字节：
//	//在使用时字符型被转化为普通整形;
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//a+b
//	//00000000000000000000000010000010
//	//存储到c中，由于c为字符型，故需进行隔断：
//	//故c中存储的为：10000010
//	char c = a + b;
//	//以整型的方式打印出c，故需要对c进行整型提升：
//	//由于c的首位为1
//	//整型提升后：
//	//11111111111111111111111110000010
//	//由于打印出的是原码：
//	//11111111111111111111111110000010：补码
//	//11111111111111111111111110000001：反码
//	//10000000000000000000000001111110：原码
//	//-126
//	printf("%c\n", c);
//	return 0;
//}
////创建结构体类型：struct Stu
//struct Stu
//{
//	//结构体类型中的成员变量：
//	char name[20];
//	int age;
//	char id[20];
//};
//int main()
//{
//	//根据结构体类型struct Stu创建结构体变量s1,s2,s3;
//	struct Stu s1 = { "颜庆龙", 18, "2013043060" };
//	struct Stu s2 = { "yql", 18, "2013043060" };
//	struct Stu s3 = { "xiaoyan", 18, "2013043060" };
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.name);
//	printf("%s\n",s1.id);
//	struct Stu* p = &s2;
//	printf("%d\n", (*p).age);
//	printf("%s\n", (*p).name);
//	printf("%s\n", (*p).id);
//	struct Stu* b = &s3;
//	printf("%d\n", b->age);
//	printf("%s\n", b->name);
//	printf("%s\n", b->id);
//	return 0;
//}