#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>


int main()
{
	//将数组的地址存放到数组指针p中
	int arr[5] = { 1,2,3,4,5 };
	int(*p)[5] = &arr;
	//*p—*：说明p是一个指针
	//p:数组指针的名称p
	//():由于[]的优先级比*高，若无()保护*，则为int *p[5]=&a;是指针数组
	//int:数组指针指向的数组元素的类型
	//[5]:数组指针指向的数组元素的个数
	//&arr:数组的地址
	char* ch[10];//创建一个指针数组ch，数组中存放着字符指针
	char*(*pch)[10] = &ch;
	//创建一个数组指针pch,存放指针数组ch的地址
	//():由于[]的优先级比*高，加()防止变为指针数组
	//*说明pch为指针
	//char*:数组指针pch指向的指针数组元素的类型为char*
	//[10]:数组指针pch指向的指针数组元素的个数为10

	return 0;
}

//int main()
//	//int* p = NULL;//p是整型指针，指向整形的指针，可以存放整型的地址
//	//char* ch = NULL;//ch是字符指针，指向字符的指针，可以存放字符的地址
//	////数组指针：-指向数组的指针，可以存放数组的地址
//	/*int arr[10] = { 0 };*/
//	//arr-数组名-数组首元素的地址
//	//&arr[0]数组首元素的地址
//	//&arr-数组的地址
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	int(* p)[10] = arr;//数组的地址要存放起来。
//	printf("%p\n", p);
//	printf("%p\n", p + 1);
//	return 0;
//}

//int main()
//{
//	int arr1[] = { 1, 2, 3, 4, 5 };
//	int arr2[] = { 2, 3, 4, 5, 6 };
//	int arr3[] = { 3, 4, 5, 6, 7 };
//	int* parr[] = { arr1, arr2, arr3 };
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)
//		{
//			printf("%d ", *(parr[i] + j));
//		}
//		printf("\n");
//	}
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = 30;
//	int d = 40;
//	int* arr[4] = { &a, &b, &c, &d };
//	int i = 0;
//	for (i = 0; i < 4; i++)
//	{
//		printf("%d ", *(arr[i]));
//	}
//	return 0;
//}

//int main()
//{
//	int arr[10] = { 0 };//整型数组
//	char ch[5] = { 0 };//字符数组
//	int* parr[10];//用来存放整型指针的数组-指针数组
//	char* pch[5];//用来存放字符指针的数组-指针数组
//	return 0;
//}

//int main()
//{
//	char arr1[] = "abcdef";
//	char arr2[] = "abcdef";
//	char* p1 = "abcdef";
//	char* p2 = "abcdef";
//	//创建一块内存存储常量字符串"abcdef"
//	//分别创建指针变量p1和p2都指向该内存，故p1和p2的地址相同
//	if (p1 == p2)
//	{
//		printf("hehe\n");
//	}
//	else
//	{
//		printf("haha\n");
//	}
//	//分别创建字符型数组arr1和arr2
//	//在arr1和arr2中都存入字符串:"abcdef"
//	//arr1和arr2分别为各自数组的首元素
//	//地址不同
//	/*if (arr1 == arr2)
//	{
//		printf("hehe\n");
//	}
//	else
//	{
//		printf("haha\n");
//	}*/
//	return 0;
//}
//int main()
//{
//	char arr[] = "abcdef";
//	char* pc = arr;
//	printf("pc = %s\n", pc);
//	return 0;
//}
//int main()
//{
//	char ch = 'w';
//	char* pc = &ch;
//	return 0;
//}

//int main()
//{
//	int arr[5] = { 1, 2, 3, 4, 5 };
//	int* p = arr;
//	return 0;
//}

//void test(int arr[])
//{
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	printf("%d", sz);
//}
//int main()
//{
//	int arr[10] = { 0 };
//	test(arr);
//	return 0;
//}

//int main()
//{
//	//00000000000000000000000000000000
//	//01111111100000000000000000000000
//	return 0;
//}
//int main()
//{
//	double a = 10.75;
//	//1010.11
//	//-1^0*1.01011*2^3
//	//s=0
//	//M=1.01011
//	//E=3
//	//1026
//	//10000000010
//	//00000000000000000000000000000000
//	//0100 0000 0010 0101 1000 0000000000000000
//	//0x4025800000000000
//	//00 00 00 00 00 80 25 40
//	//float a = 0.5;
//	//0.5
//	//0.1
//	//(-1)^s*M*2^E
//	//(-1)^0*1.0*2^(-1)
//	//-1+127=126
//	//01111110
//	//00000000000000000000000000000000
//	//0011 1111 0000 0000 0000 000000000000
//	//3f 00 00 00
//	//00 00 00 3f
//	/*float f = 5.5;*/
//	//5.5
//	//101.1
//	//(-1)^0*1.011*2^2
//	//s-0
//	//M-1.011
//	//E-2
//	//E-129-10000001
//	//00000000000000000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000 
//	//00 00 b0 40
//	return 0;
//}
//9.0
//1001.0
//(-1)^0*1.001*2^3
//(-1)^s*M*2^E
//(-1)^s是符号位，s为0，v为正，s为1，v为负
//M:有效数字，规定其范围为：（M>=1&&M<2）
//2^E是指数位
//int main()
//{
//	int n = 9;
//	//00000000
//	//00000000000000000000000000001001
//	//0 00000000 00000000000000000001001
//	float* pFloat = (float*)&n;
//	printf("n = %d\n", n);
//	printf("*pFloat = %f\n", *pFloat);//0
//	//说明整型和浮点型存储和取出的的方式不同
//	*pFloat = 9.0;
//	//9.0
//	//1001.0
//	//(-1)^0*1.001*2^3
//	//10000010
//	//00000000000000000000000000000000
//	//01000001000100000000000000000000
//	printf("n = %d\n", n);
//	printf("*pFloat = %lf\n", *pFloat);
//	return 0;
//}